In [2]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('lahman.sqlite')

query = "SELECT * FROM sqlite_master;"

df_schema = pd.read_sql_query(query, conn)

df_schema.tbl_name.unique()

array(['allstarfull', 'appearances', 'awardsmanagers', 'awardsplayers',
       'awardssharemanagers', 'awardsshareplayers', 'batting',
       'battingpost', 'collegeplaying', 'divisions', 'fielding',
       'fieldingof', 'fieldingofsplit', 'fieldingpost', 'halloffame',
       'homegames', 'leagues', 'managers', 'managershalf', 'parks',
       'people', 'pitching', 'pitchingpost', 'salaries', 'schools',
       'seriespost', 'teams', 'teamsfranchises', 'teamshalf'],
      dtype=object)

1. What was the total spent on salaries by each team, each year?

In [3]:
query1 = """
    SELECT team_ID, yearID, SUM(salary) 
    FROM salaries 
    GROUP BY team_ID, yearID;
"""

df_teams = pd.read_sql_query(query1, conn)
df_teams

     team_ID  yearID  SUM(salary)
0       1918    1985   14807000.0
1       1919    1985   11560712.0
2       1920    1985   10897560.0
3       1921    1985   14427894.0
4       1922    1985    9846178.0
..       ...     ...          ...
913     2831    2016  143053500.0
914     2832    2016   57097310.0
915     2833    2016  176038723.0
916     2834    2016  138701700.0
917     2835    2016  141652646.0

[918 rows x 3 columns]

2. What is the first and last year played for each player? Hint: Create a new table from 'Fielding.csv'.

In [4]:
query2 = """
    SELECT playerID, MIN(yearID), MAX (yearID) 
    FROM fielding 
    GROUP BY playerID;
    
"""

df_years = pd.read_sql_query(query2, conn)
df_years

        playerID  MIN(yearID)  MAX (yearID)
0      aardsda01         2004          2015
1      aaronha01         1954          1976
2      aaronto01         1962          1971
3       aasedo01         1977          1990
4       abadan01         2001          2003
...          ...          ...           ...
19486   zupofr01         1957          1961
19487  zuvelpa01         1982          1991
19488  zuverge01         1951          1959
19489  zwilldu01         1910          1916
19490   zychto01         2015          2017

[19491 rows x 3 columns]

3. Who has played the most all star games?

In [5]:
query3 = """
    SELECT playerID, COUNT(playerID) as stars 
    FROM allstarfull 
    GROUP BY playerID 
    ORDER BY stars 
    DESC LIMIT 1;
"""

df_most = pd.read_sql_query(query3, conn)
df_most

    playerID  stars
0  aaronha01     24

4. Which school has generated the most distinct players? Hint: Create new table from 'CollegePlaying.csv'.

In [6]:
query4 = """
    SELECT playerID, COUNT(playerID) as stars 
    FROM allstarfull 
    GROUP BY playerID 
    ORDER BY stars DESC 
    LIMIT 1;
"""

df_school = pd.read_sql_query(query4, conn)
df_school

    playerID  stars
0  aaronha01     24

5. Which players have the longest career? Assume that the debut and finalGame columns comprise the start and end, respectively, of a player's career. Hint: Create a new table from 'Master.csv'. Also note that strings can be converted to dates using the DATE function and can then be subtracted from each other yielding their difference in days.

In [7]:
query5 = """
    SELECT playerID, (MAX (yearID)- MIN(yearID)) as period 
    FROM fielding 
    GROUP BY playerID
    ORDER BY period DESC
    LIMIT 1;
"""

df_career = pd.read_sql_query(query5, conn)
df_career

    playerID  period
0  orourji01      32

6. What is the distribution of debut months? Hint: Look at the DATE and EXTRACT functions.

Didn't find debut

7. What is the effect of table join order on mean salary for the players listed in the main (master) table? Hint: Perform two different queries, one that joins on playerID in the salary table and other that joins on the same column in the master table. You will have to use left joins for each since right joins are not currently supported with SQLalchemy.

There's no PlayerID column in master table